# DoubleWallMaterialThickness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..DoubleWallMaterialThickness Property
FabricationPart Class See Also
---
The double wall material thickness of the fabrication part. If the fabrication part is not double walled, returns zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double DoubleWallMaterialThickness { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DoubleWallMaterialThickness As Double
	Get
```

Visual C++
---
```text
public:
property double DoubleWallMaterialThickness {
	double get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace